app/views/cart/index.html.erb


            <% item = Item.find_by_id(id) %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]