app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
---
              <td class="right aligned">
                <%= order.order_date %>