app/controllers/cart_controller.rb

  def orderCreate

    @user = User.find(current_user.id)

    @order = @user.orders.build(:order_date => DateTime.now, :status => 'Pending')

    @order.save


    @cart = session[:cart] || {}

    @cart.each do | id, quantity |

      item = Item.find_by_id(id)

      @orderitem = @order.orderitems.build(:item_id => item.id, :title => item.name, :description => item.description, :quantity => quantity, :price => item.price)


    @orderitem.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orders" ("order_date", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_date", "2017-12-06 21:27:41.349327"], ["user_id", 3], ["status", "Pending"], ["created_at", "2017-12-06 21:27:41.384539"], ["updated_at", "2017-12-06 21:27:41.384539"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 2 LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orderitems" ("item_id", "title", "description", "quantity", "price", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)