app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "football"], ["description", "Gaelic football"], ["image_url", "football.jpeg"], ["created_at", "2017-12-05 19:46:51.772122"], ["updated_at", "2017-12-05 19:46:51.772122"]]