app/controllers/items_controller.rb

INSERT INTO "items" ("name", "description", "image_url", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Soccer"], ["description", "English football"], ["image_url", "soccer.png"], ["category", "15"], ["created_at", "2017-12-04 21:35:00"], ["updated_at", "2017-12-04 21:35:00"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "O Neil's Sliotar"], ["description", "Hurling"], ["updated_at", "2017-12-06 23:02:17.677854"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)